reference_cases/urban_005_14/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     blastFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.005;  //5ms

deltaT          1e-6;//保证计算所得库郎数不超过0.5即可；

writeControl    adjustableRunTime;//自动调整时间步长

writeInterval   1e-4;//每0.0001s一个输出，即共50个输出

cycleWrite      0;

writeFormat     binary;//减少占用空间

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;//从12修改为6

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;//最大库郎数

maxDeltaT       1;//最大时间步长

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    impulse
    {
        type            impulse;
        writeControl    writeTime;
        pRef            101325;//修改的和论文中设置一样
    }
    overpressure
    {
        type            overpressure;
        writeControl    writeTime;
        store           yes;
        pRef            101325;//修改的和论文中设置一样
    }
    maxPImpulse
    {
        type            fieldMinMax;
        writeControl    writeTime;
        fields
        (
            overpressure
            impulse
        );
    }
    
    probes//按照教材p38 设置监测点
	{
	//functionObjectLibs( "libsampling.so" );
	libs	("libsampling.so");
	type	probes;
	name	probes;
	writeControl	timeStep;
	writeInterval	1;
	fields
	(
		p impulse overpressure maxPImpulse
	);
	probeLocations
	(
(-0.75 1.28 0.34)
(-0.75 1.60 0.61)
(0.89 1.60 0.75)
(0.89 0.18 0.27)
(0.48 0.49 0.27)
(1.09 -0.14 0.14)
(1.30 0.33 0.27)
(1.09 0.65 0.14)
(-0.75 0.33 0.27)
(0.68 0.18 0.07)
(1.50 1.44 0.55)
(1.09 0.33 0.68)
(1.71 0.33 0.68)
(0.48 1.13 0.55)
(-0.75 1.44 0.75)
(0.68 0.65 0.61)
(0.27 0.97 0.41)
(1.50 0.65 0.55)
(-0.34 1.28 0.07)
(1.50 1.60 0.14)
(1.71 0.18 0.14)
(-0.55 1.60 0.61)
(1.30 0.02 0.00)
(0.89 1.28 0.75)
(1.30 1.60 0.34)
(-0.75 0.18 0.68)
(-0.75 0.65 0.27)
(0.68 0.49 0.14)
(-0.75 0.33 0.75)
(0.07 1.60 0.41)
(1.30 -0.30 0.41)
(0.89 1.60 0.27)
(-0.75 0.81 0.27)
(0.68 -0.14 0.07)
(-0.55 1.44 0.00)
(1.71 0.02 0.20)
(0.07 0.18 0.41)
(0.89 -0.30 0.07)
(-0.55 0.81 0.75)
(1.50 1.28 0.14)
(1.50 0.18 0.61)
(1.30 -0.30 0.75)
(-0.75 0.65 0.61)
(0.48 1.28 0.68)
(1.09 0.97 0.27)
(0.27 0.49 0.75)
(0.27 -0.14 0.75)
(-0.34 0.97 0.00)
(1.30 0.81 0.20)
(-0.55 1.13 0.61)
(0.89 0.65 0.75)
(0.68 0.18 0.00)
(-0.75 1.44 0.07)
(0.89 0.97 0.34)
(1.50 1.13 0.07)
(1.71 0.33 0.41)
(1.71 1.28 0.55)
(0.27 1.44 0.68)
(-0.34 0.02 0.20)
(-0.75 0.18 0.34)
(1.09 0.18 0.75)
(1.50 1.13 0.14)
(0.68 0.33 0.48)
(1.09 0.02 0.68)
(0.48 1.60 0.14)
(1.09 1.13 0.07)
(0.27 1.28 0.34)
(1.71 0.97 0.27)
(0.68 0.81 0.27)
(-0.55 1.44 0.48)
(-0.75 1.28 0.61)
(-0.55 0.33 0.07)
(1.30 0.81 0.48)
(1.71 0.97 0.20)
(0.27 0.33 0.20)
(1.71 0.97 0.00)
(0.68 0.02 0.61)
(-0.34 0.33 0.07)
(-0.55 0.49 0.27)
(1.09 0.65 0.75)
(0.68 0.65 0.75)
(0.68 0.18 0.34)
(-0.75 0.81 0.34)
(-0.75 1.28 0.14)
(0.27 1.28 0.55)
(-0.14 -0.14 0.75)
(1.71 0.97 0.07)
(1.71 -0.14 0.00)
(1.50 1.28 0.27)
(0.68 -0.14 0.20)
(-0.55 1.13 0.00)
(1.09 0.81 0.14)
(1.30 0.18 0.55)
(0.27 0.97 0.34)
(0.48 -0.14 0.34)
(0.68 -0.30 0.41)
(-0.55 -0.14 0.68)
(1.30 0.97 0.07)
(0.07 0.65 0.41)
...
	);
	
	}
};

// ************************************************************************* //
