reference_cases/urban_005_14/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
//定义urban的外面大空气域：2.46*1.9*0.75的长方体块;
//设置网格尺寸为0.05m，网格数量为49*38*15=27930=2.7930w；

vertices
(
// bottom
    ( -0.75  -0.3  0.0 )  // point 0
    ( 1.71   -0.3  0.0 )  // point 1
    ( 1.71   1.6   0.0 )  // point 2
    ( -0.75  1.6   0.0 )  // point 3

// top
    ( -0.75  -0.3  0.75 )  // point 4
    ( 1.71   -0.3  0.75 )  // point 5
    ( 1.71   1.6   0.75 )  // point 6
    ( -0.75  1.6   0.75 )  // point 7
);


blocks
(
	 hex (0 1 2 3 4 5 6 7) (49 38 15) simpleGrading (1 1 1) //网格尺寸约为0.05m；	
);


edges
(
);

boundary
(
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3) //底面
        );
    }
    outlet
    {
        type patch;
        faces         //五个面：前面/右侧面/后面/左侧面/顶面
        (
            (0 1 5 4) //前面
            (1 2 6 5) //右面
            (3 2 6 7) //后面
            (0 3 7 4) //左面
            (4 5 6 7) //上面
        );
    }
    

);

mergePatchPairs
(
);

// ************************************************************************* //
