reference_cases/urban_005_14/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//论文中设置：空气采用理想气体状态方程，TNT采用JWL状态方程
phases (tnt air);                // List of phases

tnt
{
    type detonating;
    reactants//反应物
    {
        thermoType
        {
            transport   const;
            thermo      eConst;
            equationOfState BirchMurnaghan3;
        }
        equationOfState
        {
            //rho0            1601;//c4的密度
            rho0            1630;//更改为tnt的密度
            Gamma           0.25;
            pRef            101325;//从原始的101298更改为论文中的101325
            K0              8.04e9;
            K0Prime         7.97;
        }
        specie
        {
            molWeight       55.0;
        }
        transport
        {
            mu              0;              // Viscosity
            Pr              1;              // Prandtl number
        }
        thermodynamics
        {
            Cv              1400;           // Heat capacity
            Hf              0.0;
        }
    }
    products//反应产物
    {
        thermoType
        {
            transport   const;
            thermo      ePolynomial;
            equationOfState JWL;//TNT采用JWL状态方程
        }
        equationOfState
        {
            //rho0      1601;//c4的密度
            rho0      1630;//更改为tnt的密度(论文中也为1630）
            A         3.7377e8;//从原始的609.77e9更改为论文中的3.7377e8
            B         3.7471e6;//从原始的12.95e9更改为论文中的3.7471e6
            R1        4.15;//从原始的4.50更改为论文中的4.15
            R2        0.9;//从原始的1.4更改为论文中的0.9
            omega     0.35;//从原始的0.25更改为论文中的lamda=0.35
        }
        specie
        {
            molWeight       55.0;
        }
        transport
        {
            mu              0;              // Viscosity
            Pr              1;              // Prandtl number
        }
        thermodynamics
        {
            CvCoeffs<8> (413.15 2.1538 0 0 0 0 0 0);
            Sf          0.0;
            Hf          0.0;
        }
    }


    activationModel linear;
    initiation
    {  //将E0从原始的9.0e9修改为论文中的specific internal energy E=6.0e6
        E0           6.0e6;       // detonation energy in units of pressure
        points     ((0.478 0.35 0.1));     // Detonation points
        vDet       7850000;            // Detonation velocity [m/s]
        useCOM yes;
    }


    residualRho     1e-6;           // Minimum density of the phase
    residualAlpha   1e-6;          // Minimum volume fraction used for division
}

air
{
    type basic;
    thermoType
    {
        transport   const;
        thermo      eConst;
        equationOfState idealGas;//空气采用理想气体状态方程
    }
    equationOfState
    {
        gamma           1.4;            // Heat capactiy ratio
    }
    specie
    {
        molWeight       28.97;
    }
    transport
    {
        mu              0;
        Pr              1;
    }
    thermodynamics
    {
        type        eConst;
        Cv          718;
        Hf          0;
    }

    residualRho     1e-6;
    residualAlpha   1e-6;
}

// ************************************************************************* //
