reference_cases/urban_005_14/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
    timeIntegrator  RK2SSP 3;
}

gradSchemes
{
    default         cellMDLimited leastSquares 1.0;
}

divSchemes
{
    default         none;
    //div(alphaRhoPhi.c4,lambda.c4) Riemann; //c4
    div(alphaRhoPhi.tnt,lambda.tnt) Riemann; //更改为tnt
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    reconstruct(alpha)  quadraticMUSCL Minmod;
    reconstruct(rho)    quadraticMUSCL Minmod;
    reconstruct(U)      quadraticMUSCL Minmod;
    reconstruct(e)      quadraticMUSCL Minmod;
    reconstruct(p)      quadraticMUSCL Minmod;
    reconstruct(speedOfSound)   quadraticMUSCL Minmod;

    //reconstruct(lambda.c4) quadraticMUSCL Minmod;//c4
    reconstruct(lambda.tnt) quadraticMUSCL Minmod;//更改为tnt
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
